zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lsXc-pinctrl.h
/* pa28a_spi_mosi */
#define PA28A_SPI_MOSI \
	SAM_PINMUX(a, 28, a, periph)

/* pa28b_iisc_isdi */
#define PA28B_IISC_ISDI \
	SAM_PINMUX(a, 28, b, periph)

/* pa28c_abdacb_dacn0 */
#define PA28C_ABDACB_DACN0 \
	SAM_PINMUX(a, 28, c, periph)

/* pa28d_gloc_in5 */
#define PA28D_GLOC_IN5 \
	SAM_PINMUX(a, 28, d, periph)

/* pa28e_usart3_cts */
#define PA28E_USART3_CTS \
	SAM_PINMUX(a, 28, e, periph)

/* pa28g_catb_sense1 */
#define PA28G_CATB_SENSE1 \
	SAM_PINMUX(a, 28, g, periph)

/* pa29_gpio */
#define PA29_GPIO \
	SAM_PINMUX(a, 29, gpio, gpio)

/* pa29a_spi_sck */
#define PA29A_SPI_SCK \
	SAM_PINMUX(a, 29, a, periph)

/* pa29b_iisc_iws */
#define PA29B_IISC_IWS \
	SAM_PINMUX(a, 29, b, periph)

/* pa29c_abdacb_dac1 */
#define PA29C_ABDACB_DAC1 \
	SAM_PINMUX(a, 29, c, periph)

/* pa29d_gloc_in6 */
#define PA29D_GLOC_IN6 \
	SAM_PINMUX(a, 29, d, periph)

/* pa29e_usart3_clk */
#define PA29E_USART3_CLK \
	SAM_PINMUX(a, 29, e, periph)

/* pa29g_catb_sense2 */
#define PA29G_CATB_SENSE2 \
	SAM_PINMUX(a, 29, g, periph)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa30a_spi_npcs0 */
#define PA30A_SPI_NPCS0 \
	SAM_PINMUX(a, 30, a, periph)

/* pa30b_iisc_isdo */
#define PA30B_IISC_ISDO \
	SAM_PINMUX(a, 30, b, periph)

/* pa30c_abdacb_dacn1 */
#define PA30C_ABDACB_DACN1 \
	SAM_PINMUX(a, 30, c, periph)

/* pa30d_gloc_in7 */
#define PA30D_GLOC_IN7 \
	SAM_PINMUX(a, 30, d, periph)

/* pa30e_usart3_rxd */
#define PA30E_USART3_RXD \
	SAM_PINMUX(a, 30, e, periph)

/* pa30g_catb_sense3 */
#define PA30G_CATB_SENSE3 \
	SAM_PINMUX(a, 30, g, periph)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pa31a_spi_npcs1 */
#define PA31A_SPI_NPCS1 \
	SAM_PINMUX(a, 31, a, periph)

/* pa31b_iisc_imck */
#define PA31B_IISC_IMCK \
	SAM_PINMUX(a, 31, b, periph)

/* pa31c_abdacb_clk */
#define PA31C_ABDACB_CLK \
	SAM_PINMUX(a, 31, c, periph)

/* pa31d_gloc_out1 */
#define PA31D_GLOC_OUT1 \
	SAM_PINMUX(a, 31, d, periph)

/* pa31e_usart3_txd */
#define PA31E_USART3_TXD \
	SAM_PINMUX(a, 31, e, periph)

/* pa31g_catb_dis */
#define PA31G_CATB_DIS \
	SAM_PINMUX(a, 31, g, periph)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_twims1_twd */
#define PB0A_TWIMS1_TWD \
	SAM_PINMUX(b, 0, a, periph)

/* pb0b_usart0_rxd */
#define PB0B_USART0_RXD \
	SAM_PINMUX(b, 0, b, periph)

/* pb0g_catb_sense21 */
#define PB0G_CATB_SENSE21 \
	SAM_PINMUX(b, 0, g, periph)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_twims1_twck */
#define PB1A_TWIMS1_TWCK \
	SAM_PINMUX(b, 1, a, periph)

/* pb1b_usart0_txd */
#define PB1B_USART0_TXD \
	SAM_PINMUX(b, 1, b, periph)

/* pb1c_eic_extint0 */
#define PB1C_EIC_EXTINT0 \
	SAM_PINMUX(b, 1, c, periph)

/* pb1g_catb_sense22 */
#define PB1G_CATB_SENSE22 \
	SAM_PINMUX(b, 1, g, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_adcife_ad3 */
#define PB2A_ADCIFE_AD3 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_usart1_rts */
#define PB2B_USART1_RTS \
	SAM_PINMUX(b, 2, b, periph)

/* pb2c_abdacb_dac0 */
#define PB2C_ABDACB_DAC0 \
	SAM_PINMUX(b, 2, c, periph)

/* pb2d_iisc_isck */
#define PB2D_IISC_ISCK \
	SAM_PINMUX(b, 2, d, periph)

/* pb2e_acifc_acbn0 */
#define PB2E_ACIFC_ACBN0 \
	SAM_PINMUX(b, 2, e, periph)

/* pb2g_catb_sense23 */
#define PB2G_CATB_SENSE23 \
	SAM_PINMUX(b, 2, g, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_adcife_ad4 */
#define PB3A_ADCIFE_AD4 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_usart1_clk */
#define PB3B_USART1_CLK \
	SAM_PINMUX(b, 3, b, periph)

/* pb3c_abdacb_dacn0 */
#define PB3C_ABDACB_DACN0 \
	SAM_PINMUX(b, 3, c, periph)

/* pb3d_iisc_isdi */
#define PB3D_IISC_ISDI \
	SAM_PINMUX(b, 3, d, periph)

/* pb3e_acifc_acbp0 */
#define PB3E_ACIFC_ACBP0 \
	SAM_PINMUX(b, 3, e, periph)

/* pb3g_catb_dis */
#define PB3G_CATB_DIS \
	SAM_PINMUX(b, 3, g, periph)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_adcife_ad5 */
#define PB4A_ADCIFE_AD5 \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_usart1_rxd */
#define PB4B_USART1_RXD \
	SAM_PINMUX(b, 4, b, periph)

/* pb4c_abdacb_dac1 */
#define PB4C_ABDACB_DAC1 \
	SAM_PINMUX(b, 4, c, periph)

/* pb4d_iisc_isdo */
#define PB4D_IISC_ISDO \
	SAM_PINMUX(b, 4, d, periph)

/* pb4e_dacc_ext_trig0 */
#define PB4E_DACC_EXT_TRIG0 \
	SAM_PINMUX(b, 4, e, periph)

/* pb4g_catb_sense24 */
#define PB4G_CATB_SENSE24 \
	SAM_PINMUX(b, 4, g, periph)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_adcife_ad6 */
#define PB5A_ADCIFE_AD6 \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_usart1_txd */
#define PB5B_USART1_TXD \
	SAM_PINMUX(b, 5, b, periph)

/* pb5c_abdacb_dacn1 */
#define PB5C_ABDACB_DACN1 \
	SAM_PINMUX(b, 5, c, periph)

/* pb5d_iisc_imck */
#define PB5D_IISC_IMCK \
	SAM_PINMUX(b, 5, d, periph)

/* pb5g_catb_sense25 */
#define PB5G_CATB_SENSE25 \
	SAM_PINMUX(b, 5, g, periph)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6a_usart3_rts */
#define PB6A_USART3_RTS \
	SAM_PINMUX(b, 6, a, periph)

/* pb6c_gloc_in4 */
#define PB6C_GLOC_IN4 \
	SAM_PINMUX(b, 6, c, periph)

/* pb6d_iisc_iws */
#define PB6D_IISC_IWS \
	SAM_PINMUX(b, 6, d, periph)

/* pb6g_catb_sense26 */
#define PB6G_CATB_SENSE26 \
	SAM_PINMUX(b, 6, g, periph)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7a_usart3_cts */
#define PB7A_USART3_CTS \
	SAM_PINMUX(b, 7, a, periph)

/* pb7c_gloc_in5 */
#define PB7C_GLOC_IN5 \
	SAM_PINMUX(b, 7, c, periph)

/* pb7d_tc0_a0 */
#define PB7D_TC0_A0 \
	SAM_PINMUX(b, 7, d, periph)

/* pb7g_catb_sense27 */
#define PB7G_CATB_SENSE27 \
	SAM_PINMUX(b, 7, g, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_usart3_clk */
#define PB8A_USART3_CLK \
	SAM_PINMUX(b, 8, a, periph)

/* pb8c_gloc_in6 */
#define PB8C_GLOC_IN6 \
	SAM_PINMUX(b, 8, c, periph)

/* pb8d_tc0_b0 */
#define PB8D_TC0_B0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8g_catb_sense28 */
#define PB8G_CATB_SENSE28 \
	SAM_PINMUX(b, 8, g, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_usart3_rxd */
#define PB9A_USART3_RXD \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_pevd_evt2 */
#define PB9B_PEVD_EVT2 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9c_gloc_in7 */
#define PB9C_GLOC_IN7 \
	SAM_PINMUX(b, 9, c, periph)

/* pb9d_tc0_a1 */
#define PB9D_TC0_A1 \
	SAM_PINMUX(b, 9, d, periph)

