zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lsXc-pinctrl.h
/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_adcife_ad8 */
#define PC8A_ADCIFE_AD8 \
	SAM_PINMUX(c, 8, a, periph)

/* pc8b_usart2_clk */
#define PC8B_USART2_CLK \
	SAM_PINMUX(c, 8, b, periph)

/* pc8c_pevc_evt1 */
#define PC8C_PEVC_EVT1 \
	SAM_PINMUX(c, 8, c, periph)

/* pc8d_tc1_clk2 */
#define PC8D_TC1_CLK2 \
	SAM_PINMUX(c, 8, d, periph)

/* pc8e_usart2_cts */
#define PC8E_USART2_CTS \
	SAM_PINMUX(c, 8, e, periph)

/* pc8g_catb_sense10 */
#define PC8G_CATB_SENSE10 \
	SAM_PINMUX(c, 8, g, periph)

/* pc9_gpio */
#define PC9_GPIO \
	SAM_PINMUX(c, 9, gpio, gpio)

/* pc9a_adcife_ad9 */
#define PC9A_ADCIFE_AD9 \
	SAM_PINMUX(c, 9, a, periph)

/* pc9b_usart3_rxd */
#define PC9B_USART3_RXD \
	SAM_PINMUX(c, 9, b, periph)

/* pc9c_abdacb_dac0 */
#define PC9C_ABDACB_DAC0 \
	SAM_PINMUX(c, 9, c, periph)

/* pc9d_iisc_isck */
#define PC9D_IISC_ISCK \
	SAM_PINMUX(c, 9, d, periph)

/* pc9e_acifc_acan1 */
#define PC9E_ACIFC_ACAN1 \
	SAM_PINMUX(c, 9, e, periph)

/* pc9g_catb_sense11 */
#define PC9G_CATB_SENSE11 \
	SAM_PINMUX(c, 9, g, periph)

/* pc10_gpio */
#define PC10_GPIO \
	SAM_PINMUX(c, 10, gpio, gpio)

/* pc10a_adcife_ad10 */
#define PC10A_ADCIFE_AD10 \
	SAM_PINMUX(c, 10, a, periph)

/* pc10b_usart3_txd */
#define PC10B_USART3_TXD \
	SAM_PINMUX(c, 10, b, periph)

/* pc10c_abdacb_dacn0 */
#define PC10C_ABDACB_DACN0 \
	SAM_PINMUX(c, 10, c, periph)

/* pc10d_iisc_isdi */
#define PC10D_IISC_ISDI \
	SAM_PINMUX(c, 10, d, periph)

/* pc10e_acifc_acap1 */
#define PC10E_ACIFC_ACAP1 \
	SAM_PINMUX(c, 10, e, periph)

/* pc10g_catb_sense12 */
#define PC10G_CATB_SENSE12 \
	SAM_PINMUX(c, 10, g, periph)

/* pc11_gpio */
#define PC11_GPIO \
	SAM_PINMUX(c, 11, gpio, gpio)

/* pc11a_adcife_ad11 */
#define PC11A_ADCIFE_AD11 \
	SAM_PINMUX(c, 11, a, periph)

/* pc11b_usart2_rxd */
#define PC11B_USART2_RXD \
	SAM_PINMUX(c, 11, b, periph)

/* pc11c_pevc_evt2 */
#define PC11C_PEVC_EVT2 \
	SAM_PINMUX(c, 11, c, periph)

/* pc11g_catb_sense13 */
#define PC11G_CATB_SENSE13 \
	SAM_PINMUX(c, 11, g, periph)

/* pc12_gpio */
#define PC12_GPIO \
	SAM_PINMUX(c, 12, gpio, gpio)

/* pc12a_adcife_ad12 */
#define PC12A_ADCIFE_AD12 \
	SAM_PINMUX(c, 12, a, periph)

/* pc12b_usart2_txd */
#define PC12B_USART2_TXD \
	SAM_PINMUX(c, 12, b, periph)

/* pc12c_abdacb_clk */
#define PC12C_ABDACB_CLK \
	SAM_PINMUX(c, 12, c, periph)

/* pc12d_iisc_iws */
#define PC12D_IISC_IWS \
	SAM_PINMUX(c, 12, d, periph)

/* pc12g_catb_sense14 */
#define PC12G_CATB_SENSE14 \
	SAM_PINMUX(c, 12, g, periph)

/* pc13_gpio */
#define PC13_GPIO \
	SAM_PINMUX(c, 13, gpio, gpio)

/* pc13a_adcife_ad13 */
#define PC13A_ADCIFE_AD13 \
	SAM_PINMUX(c, 13, a, periph)

/* pc13b_usart3_rts */
#define PC13B_USART3_RTS \
	SAM_PINMUX(c, 13, b, periph)

/* pc13c_abdacb_dac1 */
#define PC13C_ABDACB_DAC1 \
	SAM_PINMUX(c, 13, c, periph)

/* pc13d_iisc_isdo */
#define PC13D_IISC_ISDO \
	SAM_PINMUX(c, 13, d, periph)

/* pc13e_acifc_acbn1 */
#define PC13E_ACIFC_ACBN1 \
	SAM_PINMUX(c, 13, e, periph)

/* pc13g_catb_sense15 */
#define PC13G_CATB_SENSE15 \
	SAM_PINMUX(c, 13, g, periph)

/* pc14_gpio */
#define PC14_GPIO \
	SAM_PINMUX(c, 14, gpio, gpio)

/* pc14a_adcife_ad14 */
#define PC14A_ADCIFE_AD14 \
	SAM_PINMUX(c, 14, a, periph)

/* pc14b_usart3_clk */
#define PC14B_USART3_CLK \
	SAM_PINMUX(c, 14, b, periph)

/* pc14c_abdacb_dacn1 */
#define PC14C_ABDACB_DACN1 \
	SAM_PINMUX(c, 14, c, periph)

/* pc14d_iisc_imck */
#define PC14D_IISC_IMCK \
	SAM_PINMUX(c, 14, d, periph)

/* pc14e_acifc_acbp1 */
#define PC14E_ACIFC_ACBP1 \
	SAM_PINMUX(c, 14, e, periph)

/* pc14g_catb_dis */
#define PC14G_CATB_DIS \
	SAM_PINMUX(c, 14, g, periph)

/* pc15_gpio */
#define PC15_GPIO \
	SAM_PINMUX(c, 15, gpio, gpio)

/* pc15a_tc1_a0 */
#define PC15A_TC1_A0 \
	SAM_PINMUX(c, 15, a, periph)

/* pc15d_gloc_in4 */
#define PC15D_GLOC_IN4 \
	SAM_PINMUX(c, 15, d, periph)

/* pc15g_catb_sense16 */
#define PC15G_CATB_SENSE16 \
	SAM_PINMUX(c, 15, g, periph)

/* pc16_gpio */
#define PC16_GPIO \
	SAM_PINMUX(c, 16, gpio, gpio)

/* pc16a_tc1_b0 */
#define PC16A_TC1_B0 \
	SAM_PINMUX(c, 16, a, periph)

/* pc16d_gloc_in5 */
#define PC16D_GLOC_IN5 \
	SAM_PINMUX(c, 16, d, periph)

/* pc16g_catb_sense17 */
#define PC16G_CATB_SENSE17 \
	SAM_PINMUX(c, 16, g, periph)

/* pc17_gpio */
#define PC17_GPIO \
	SAM_PINMUX(c, 17, gpio, gpio)

/* pc17a_tc1_a1 */
#define PC17A_TC1_A1 \
	SAM_PINMUX(c, 17, a, periph)

/* pc17d_gloc_in6 */
#define PC17D_GLOC_IN6 \
	SAM_PINMUX(c, 17, d, periph)

/* pc17g_catb_sense18 */
#define PC17G_CATB_SENSE18 \
	SAM_PINMUX(c, 17, g, periph)

/* pc18_gpio */
#define PC18_GPIO \
	SAM_PINMUX(c, 18, gpio, gpio)

/* pc18a_tc1_b1 */
#define PC18A_TC1_B1 \
	SAM_PINMUX(c, 18, a, periph)

/* pc18d_gloc_in7 */
#define PC18D_GLOC_IN7 \
	SAM_PINMUX(c, 18, d, periph)

/* pc18g_catb_sense19 */
#define PC18G_CATB_SENSE19 \
	SAM_PINMUX(c, 18, g, periph)

/* pc19_gpio */
#define PC19_GPIO \
	SAM_PINMUX(c, 19, gpio, gpio)

/* pc19a_tc1_a2 */
#define PC19A_TC1_A2 \
	SAM_PINMUX(c, 19, a, periph)

/* pc19d_gloc_out1 */
#define PC19D_GLOC_OUT1 \
	SAM_PINMUX(c, 19, d, periph)

/* pc19g_catb_sense20 */
#define PC19G_CATB_SENSE20 \
	SAM_PINMUX(c, 19, g, periph)

/* pc20_gpio */
#define PC20_GPIO \
	SAM_PINMUX(c, 20, gpio, gpio)

/* pc20a_tc1_b2 */
#define PC20A_TC1_B2 \
	SAM_PINMUX(c, 20, a, periph)

/* pc20g_catb_sense21 */
#define PC20G_CATB_SENSE21 \
	SAM_PINMUX(c, 20, g, periph)

/* pc21_gpio */
#define PC21_GPIO \
	SAM_PINMUX(c, 21, gpio, gpio)

/* pc21a_tc1_clk0 */
#define PC21A_TC1_CLK0 \
	SAM_PINMUX(c, 21, a, periph)

/* pc21d_parc_pcck */
#define PC21D_PARC_PCCK \
	SAM_PINMUX(c, 21, d, periph)

/* pc21g_catb_sense22 */
#define PC21G_CATB_SENSE22 \
	SAM_PINMUX(c, 21, g, periph)

/* pc22_gpio */
#define PC22_GPIO \
	SAM_PINMUX(c, 22, gpio, gpio)

/* pc22a_tc1_clk1 */
#define PC22A_TC1_CLK1 \
	SAM_PINMUX(c, 22, a, periph)

/* pc22d_parc_pcen1 */
#define PC22D_PARC_PCEN1 \
	SAM_PINMUX(c, 22, d, periph)

/* pc22g_catb_sense23 */
#define PC22G_CATB_SENSE23 \
	SAM_PINMUX(c, 22, g, periph)

/* pc23_gpio */
#define PC23_GPIO \
	SAM_PINMUX(c, 23, gpio, gpio)

/* pc23a_tc1_clk2 */
#define PC23A_TC1_CLK2 \
	SAM_PINMUX(c, 23, a, periph)

/* pc23d_parc_pcen2 */
#define PC23D_PARC_PCEN2 \
	SAM_PINMUX(c, 23, d, periph)

